NumPy Continue

In [ ]:
import numpy as np
import matplotlib.pyplot as plt
import time 
try:
    while True:
        a=np.random.randint(0,255,(50,50,3))
        plt.imshow(a)
        plt.show()
        time.sleep(0.03)
        display(clear=True)
        
except:
    print('Stopped')

In [ ]:
import numpy as np
import matplotlib.pyplot as plt
arr=np.random.randint(1,10,(4,3,3))
print(arr)

splitted_arr=np.split(arr,2)
print(splitted_arr)

In [ ]:
import numpy as np
import matplotlib.pyplot as plt
arr=np.random.randint(0,255,(4,4,3))
print(f"Original Array\n{arr}\n Splitted Array ")
two_split_arr=np.split(arr,2)
print(two_split_arr)
'''plt.imshow(new_arr[0]) #to print first half of the splitted array
plt.show()
plt.imshow(new_arr[1]) #to print second half of the splitted array
plt.show()'''

four_split_arr=np.split(arr,4)
print(four_split_arr)

print(np.split(arr,2, axis=1))

In [ ]:
#To split the image in half
import numpy as np
import matplotlib.pyplot as plt
url='D:\\Data Science\\Summer-Training-Project\\Day_9\\20250713_154809.jpg'
arr=plt.imread(url)
punch_cat=arr.copy() #Need to make a copy first
punch_cat.shape #Check the shape of the image array first
print(arr.shape)
print(arr)

# plt.imshow(punch_cat)
plt.imshow(np.split(arr,2,axis=0)[0])
plt.imshow(np.split(arr,4,axis=1)[3])


# 1080//7 = 154
# plt.show(punch_cat[:,:154,:])

In [ ]:
#np.where()
import numpy as np
arr=np.random.randint(1,500,(4,4))
print(arr)
location=np.where(arr>200)
print(type(location))
display(np.where(arr>200,'High Sales','Low Sales'))
display(np.where(arr>200,'High Sales',arr))


#Clip() to handle outliers (same as upper whisker and lower whisker)
np.clip(arr,100,300) #100 is lower whisker, 300 is upper whisker

Broadcasting

In [ ]:
import numpy as np
arr_1=np.random.randint(1,10,4)
arr_2=np.random.randint(1,10,(2,4))
print(f"1D Array: \n{arr_1}")
print(f"2D Array: \n{arr_2}")
print(f"Broadcasted array:\n{arr_2+arr_1}")

In [ ]:
import numpy as np
a = np.random.randint(1,10,7)
b = np.random.randint(1,10,(1,7))

print(a)
print('\n\n')
print(b)
print('\n\n')
print(a+b)

Pandas: Panel Data Analysis

In [172]:
import pandas as pd
import numpy as np
import random
products=['Chair','Table','Laptop','Mobile Phones','Charger']
region=['East','West','North','South']
all_date=pd.date_range('01-01-2025','23-07-2025')
dict1={'Order ID':np.arange(1,1001),
       'Region Name':random.choices(region,k=1000),
       'Date':random.choices(all_date,k=1000),
       'Product Name':random.choices(products,k=1000),
       'Sales':np.random.randint(100,100000,1000),
       'Qty':np.random.randint(1,10,1000),
       'Profit':np.random.randint(-10000,10000,1000)}
df=pd.DataFrame(dict1)
# display(df)
display(df.info())
display(df.columns)
display(df.index)
display(df.head(10))
display(df.tail(10))
display(df.sample())
display(df.isnull().value_counts())
# df.fillna(df['Qty'].mean())
# df.dropna()
# print(df.duplicated().sum())
# df.drop_duplicates()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Order ID      1000 non-null   int64
 1   Region Name   1000 non-null   object
 2   Date          1000 non-null   datetime64[ns]
 3   Product Name  1000 non-null   object
 4   Sales         1000 non-null   int32
 5   Qty           1000 non-null   int32
 6   Profit        1000 non-null   int32
dtypes: datetime64[ns](1), int32(3), int64(1), object(2)
memory usage: 43.1+ KB

None

Index(['Order ID', 'Region Name', 'Date', 'Product Name', 'Sales', 'Qty',
       'Profit'],
      dtype='object')

RangeIndex(start=0, stop=1000, step=1)

   Order ID Region Name       Date   Product Name  Sales  Qty  Profit
0         1       South 2025-04-12         Laptop  52396    8   -7917
1         2       South 2025-01-01          Table  25547    7   -8704
2         3        East 2025-04-19         Laptop  23770    8   -6669
3         4       South 2025-02-14          Chair   6368    7    4585
4         5       South 2025-04-08          Table  35834    6    4184
5         6        West 2025-03-06        Charger  63503    6   -8844
6         7        West 2025-04-30  Mobile Phones  98580    8    7840
7         8        East 2025-05-11          Table   3830    3   -7518
8         9        East 2025-03-15  Mobile Phones  89516    9     448
9        10       South 2025-05-16         Laptop  33497    4   -3440

     Order ID Region Name       Date   Product Name  Sales  Qty  Profit
990       991       South 2025-04-20         Laptop  95613    6   -1375
991       992        East 2025-02-03         Laptop  34181    1    5024
992       993       South 2025-04-28        Charger  65037    6   -3732
993       994        West 2025-04-18  Mobile Phones  64355    2   -9400
994       995       South 2025-07-18         Laptop  23666    9   -2904
995       996        West 2025-05-02  Mobile Phones  42566    5   -3609
996       997        East 2025-03-04        Charger  86058    7   -8294
997       998       North 2025-02-27  Mobile Phones  21932    3    5501
998       999       South 2025-07-16         Laptop  89070    9    -885
999      1000        East 2025-05-17          Chair   2039    7   -5305

     Order ID Region Name       Date Product Name  Sales  Qty  Profit
379       380        West 2025-02-15        Chair  34736    6    1770

Order ID  Region Name  Date   Product Name  Sales  Qty    Profit
False     False        False  False         False  False  False     1000
Name: count, dtype: int64